movies = [
 {
  "title": "Викрадена на різдво",
  "genre": ["комедія"],
  "time": 25,
  "type": "серіал",
  "episode_time": 0,
  "seasons": 1,
  "episodes_per_season": 0,
  "image": "Викрадена_на_різдво.jpg",
  "description": "Події розгортаються навколо Христини та Матвія, які використовують викрадення як шанс змінити своє життя, переживають пригоди та романтичні ситуації, і дедалі більше наближаються до святкового фіналу з різдвяним чудом."
 },
 {
  "title": "Встигнути до 30",
  "genre": ["комедія"],
  "time": 22,
  "episode_time": 22,
  "seasons": 2,
  "episodes_per_season": 16,
  "type": "серіал",
  "image": "Встигнути_до_30.jpg",
  "description": "Три дівчини зустрічаються в день свого 29-річчя і вирішують змінити життя за рік до тридцятиріччя. Комедія про дружбу та самореалізацію."
 },
 {
  "title": "Кава з кардамоном",
  "genre": ["мелодрама"],
  "time": 49,
  "episode_time": 49,
  "seasons": 1,
  "episodes_per_season": 48,
  "type": "серіал",
  "image": "Кава_з_кардамоном.jpg",
  "description": "Заборонене кохання українки та польського шляхтича у Львові XIX століття. Історична драма про кохання всупереч суспільним нормам."
 },
 {
  "title": "Ніхто не ідеальний",
  "genre": ["мелодрама"],
  "time": 47,
  "episode_time": 47,
  "seasons": 1,
  "episodes_per_season": 32,
  "type": "серіал",
  "image": "Ніхто_не_ідеальний.jpg",
  "description": "18-річна дівчина приїжджає до дядька за спадщиною, але стикається з ворожнечею родичів. Мелодрама про боротьбу за спадок."
  },
 {
  "title": "Ромео і Джульєта з Черкас",
  "genre": ["мелодрама"],
  "time": 26,
  "episode_time": 26,
  "seasons": 3,
  "episodes_per_season": 16,
  "type": "серіал",
  "image": "Ромео_і_Джульєта_з_Черкас.jpg",
  "description": "Закохана пара хоче одружитися, але їхні батьки ворогують. Сучасний комедійний переказ шекспірівської класики."
  },
 {
  "title": "Скажене Весілля",
  "genre": ["комедія"],
  "time": 88,
  "type": "фільм",
  "image": "Скажене_весілля.jpg",
  "description": "Український батько готується до весілля дочки з французом, але шокований, що наречений – афрофранцуз. Комедія про стереотипи."
  },
 {
  "title": "Скажене Весілля 2",
  "genre": ["комедія"],
  "time": 93,
  "type": "фільм",
  "image": "Скажене_весілля_2.jpg",
  "description": "Син Василя Середюка одружується з дочкою заможного одеського бізнесмена. Два абсолютно різні світи зіштовхуються: простий провінційний батько проти амбітного"
  },
 {
  "title": "Скажене Весілля 3",
  "genre": ["комедія"],
  "time": 96,
  "type": "фільм",
  "image": "Скажене_весілля_3.jpg",
  "description": "Наймолодший син Середюків одружується з дочкою циганського барона. Комедія про міжкультурне весілля."
  },
 {
  "title": "Скажені сусіди",
  "genre": ["мелодрама"],
  "time": 23,
  "episode_time": 23,
  "seasons": 3,
  "episodes_per_season": 24,
  "type": "серіал",
  "image": "Скажені_сусіди.jpg",
  "description": "Серіал-продовження трилогії. Ворог Василя Середюка стає сусідом, починається протистояння двох родин."
  },
 {
  "title": "Дивні дива",
  "genre": ["жахи"],
  "time": 50,
  "episode_time": 50,
  "seasons": 5,
  "episodes_per_season": 8,
  "type": "серіал",
  "image": "Дивні_дива.jpg",
  "description": "Американський серіал Netflix про зникнення хлопчика та таємничі події в містечку."
  },
{
  "title": "Слід",
  "genre": ["детектив"],
  "time": 45,
  "episode_time": 45,
  "seasons": 3,
  "episodes_per_season": 36,
  "type": "серіал",
  "image": "Слід.jpg",
  "description": "Детективний серіал про роботу спецагенції ОСА, яка розкриває найскладніші злочини в Україні."
  },
{
  "title": "КОД",
  "genre": ["детектив"],
  "time": 45,
  "episode_time": 45,
  "seasons": 4,
  "episodes_per_season": 72,
  "type": "серіал",
  "image": "КОД.jpg",
  "description": "Новий спецпідрозділ поліції використовує штучний інтелект для розкриття надскладних кримінальних справ."
  },
{
  "title": "Водна поліція",
  "genre": ["детектив"],
  "time": 45,
  "episode_time": 45,
  "seasons": 1,
  "episodes_per_season": 44,
  "type": "серіал",
  "image": "Водна_поліція.jpg",
  "description": "Детектив про підрозділ, який патрулює Дніпро і розкриває злочини на воді."
  },
{
  "title": "Морська поліція",
  "genre": ["бойовик"],
  "time": 41,
  "episode_time": 41,
  "seasons": 1,
  "episodes_per_season": 20,
  "type": "серіал",
  "image": "Морська_поліція.jpg",
  "description": "Екшн-детектив про роботу морської поліції на чорноморському узбережжі."
  },
{
  "title": "Дрони вбивці",
  "genre": ["мультфільми"],
  "time": 23,
  "episode_time": 23,
  "seasons": 1,
  "episodes_per_season": 8,
  "type": "серіал",
  "image": "Дрони_вбивці.png",
  "description": "Постапокаліптичний світ, де роботи-робітники на планеті Коппер-9 переховуються від дронів-вбивць, відправлених корпорацією для їх знищення. Дівчина-робот Узі дружить з дроном-вбивцею N."
  },
{
  "title": "Грінч",
  "genre": ["мультфільми"],
  "time": 85,
  "type": "фільм",
  "image": "Грінч.png",
  "description": "Зелений самітник Грінч ненавидить Різдво і вирішує вкрасти свято у мешканців містечка Хтовськ, поки не зустрічає милу дівчинку Сінді-Лу."
  },
{
  "title": "Клаус",
  "genre": ["мультфільми"],
  "time": 90,
  "type": "фільм",
  "image": "Клаус.png",
  "description": "Ледачий листоноша Джеспер потрапляє в північне містечко, де дружить з таємничим тесляром Клаусом. Разом вони починають роздавати іграшки дітям. Історія про походження Санта-Клауса."
  },
{
  "title": "Ману",
  "genre": ["мультфільми"],
  "time": 88,
  "type": "фільм",
  "image": "Ману.png",
  "description": "Стриж, якого виховали чайки, вважає себе чайкою. Але після болючої правди про своє походження він йде з родини. Ману шукає себе у світі, знаходить нових друзів-стрижів і вчиться приймати свою справжню природу."
  },
{
  "title": "Реальна білка",
  "genre": ["мультфільми"],
  "time": 85,
  "type": "фільм",
  "image": "Реальна_білка.png",
  "description": "Білка Сьорджі та його друзі планують пограбування крамниці горіхів, щоб запастися їжею на зиму."
  },
{
  "title": "Реальна білка 2",
  "genre": ["мультфільми"],
  "time": 90,
  "type": "фільм",
  "image": "Реальна_білка_2.png",
  "description": "Сьорджі та його друзі борються за свій парк, який хочуть знести для будівництва розважального парку."
  },
{
  "title": "Звіротрополіс",
  "genre": ["мультфільми"],
  "time": 108,
  "type": "фільм",
  "image": "Звіротрополіс.png",
  "description": "Кроленя-поліцейська Джуді Гопс і лис-шахрай Нік Вайлд розслідують зникнення тварин у місті, де хижаки і травоїдні живуть разом."
  },
{
  "title": "Звіротрополіс 2",
  "genre": ["мультфільми"],
  "time": 108,
  "type": "фільм",
  "image": "Звіротрополіс_2.png",
  "description": "Джуді та Нік вирушають у нову пригоду за межі Звіротрополіса, де стикаються з новими загрозами і загадками."
  },
{
  "title": "Ранго",
  "genre": ["мультфільми"],
  "time": 107,
  "type": "фільм",
  "image": "Ранго.png",
  "description": "Хамелеон-домашня тварина випадково потрапляє в пустельне містечко і стає його шерифом, змушений захищати жителів від бандитів."
  },
{
  "title": "Співай",
  "genre": ["мультфільми"],
  "time": 108,
  "type": "фільм",
  "image": "Співай.png",
  "description": "Коала Бастер Мун організовує вокальний конкурс, щоб врятувати свій театр від банкрутства. Різні тварини змагаються за головний приз."
  },
{
  "title": "Лука",
  "genre": ["мультфільми"],
  "time": 95,
  "type": "фільм",
  "image": "Лука.png",
  "description": "Морський монстр Лука проводить літо в італійському містечку, ховаючи свою справжню сутність і мріючи про пригоди на Веспі."
  },
{
  "title": "Будинок на щастя",
  "genre": ["комедія"],
  "time": 25,
  "episode_time": 25,
  "seasons": 6,
  "episodes_per_season": 32,
  "type": "серіал",
  "image": "Будинок_на_щастя.png",
  "description": "Молоде подружжя переїжджає до села, відкриває ферму і потрапляє у кумедні та сімейні пригоди, зіштовхуючись із сільським життям і власними мріями."
  },
{
  "title": "Одна родина",
  "genre": ["драма"],
  "time": 50,
  "episode_time": 50,
  "seasons": 1,
  "episodes_per_season": 4,
  "type": "серіал",
  "image": "Одна_родина.jpg",
  "description": "Серіал розповідає про Оксану Романюк та Максима Куца з ворогуючих родин, конфлікт яких тягнеться через землю та давні образи. Попри ворожнечу, молоді закохуються, долаючи сімейні таємниці, зраду та війну. Їхнє кохання стає спробою примирити родини."
  },
{
  "title": "Моя улюблена Страшко",
  "genre": ["мелодрама"],
  "time": 47,
  "episode_time": 47,
  "seasons": 1,
  "episodes_per_season": 48,
  "type": "серіал",
  "image": "Моя_улюблена_страшко.jpg",
  "description": "Настя стає асистентом директора косметичної компанії Bon Visage. Вона намагається довести, що розум важливіший за зовнішність. Бос Максим закохується в неї, але його друг пропонує зіграти роман задля порятунку компанії. Настя підслуховує про корисливий план, звільняється, а акції Макса переходять до Георгія."
  },
{
  "title": "Спіймати Кайдаша",
  "genre": ["драма"],
  "time": 45,
  "episode_time": 45,
  "seasons": 1,
  "episodes_per_season": 12,
  "type": "серіал",
  "image": "Спіймати_Кайдаша.jpg",
  "description": "Сучасна екранізація повісті Івана Нечуя-Левицького «Кайдашева сім'я». Сценаристка Наталка Ворожбит перенесла події у 2005-2014 роки. Серіал показує конфлікт поколінь у родині Кайдашів. Апогей протистояння — 2014 рік: один син, Лаврін, йде захищати Україну від російської агресії, а другий, Карпо, підтримує Росію та звинувачує Майдан у війні. Серіал закінчується відкритим фіналом."
  },
{
  "title": "Коло омани",
  "genre": ["драма","мелодрама"],
  "time": 51,
  "episode_time": 51,
  "seasons": 1,
  "episodes_per_season": 20,
  "type": "серіал",
  "image": "Коло_омани.jpg",
  "description": "Коло омани — український детектив, адаптація корейського шоу 'Lie After Lie'. Ліна стає жертвою домашнього насильства та потрапляє у в'язницю за вбивство чоловіка. Після десяти років вона народжує доньку, яку забирає свекруха для помсти. Ліна прагне повернути дитину, але боїться розкрити своє минуле."
  },
{
  "title": "Дивовижний цифровий цирк",
  "genre": ["мультфільм"],
  "time": 25,
  "episode_time": 25,
  "seasons": 1,
  "episodes_per_season": 7,
  "type": "серіал",
  "image": "Дивовижний_цифровий_цирк.jpg",
  "description": "Дівчина одягає гарнітуру і потрапляє у цифровий цирк, де стає блазнем на ім'я Помні. Там перебувають ще п'ятеро колишніх людей, які підкоряються ведучому Кейну та виконують його завдання. Помні намагається знайти вихід, але всі шляхи виявляються фальшивими. Інші персонажі вже полишили надію втекти. Раніше тут перебували інші, які збожеволіли та перетворилися на чудовиськ."
  },
{
  "title": "Готель Хазбін",
  "genre": ["мультфільм"],
  "time": 37,
  "episode_time": 37,
  "seasons": 2,
  "episodes_per_season": 8,
  "type": "серіал",
  "image": "Готель_Хазбін.jpg",
  "description": "Готель Газбін — це анімаційний мультсеріал, створений Вів'єн Медрано. Дія розгортається навколо Чарлі Морнінгстар, принцеси пекла, яка намагається відкрити готель для реабілітації грішників, щоб зменшити перенаселення пекла. Готель пропонує грішникам шанс на спокуту, щоб звільнити місце для нових душ."
  },
{
  "title": "Черговий лікар",
  "genre": ["драма"],
  "time": 45,
  "episode_time": 45,
  "seasons": 3,
  "episodes_per_season": 16,
  "type": "серіал",
  "image": "Черговий_лікар.jpg",
  "description": "Український серіал про будні лікарів швидкої допомоги. Головний герой — талановитий хірург, який рятує життя пацієнтів, долаючи професійні та особисті виклики. Серіал показує драматичні історії, складні медичні випадки та людські долі."
  },
{
  "title": "Готель Галіція",
  "genre": ["драма","комедія"],
  "time": 45,
  "episode_time": 45,
  "seasons": 4,
  "episodes_per_season": 10,
  "type": "серіал",
  "image": "Готель_Галіція.jpg",
  "description": "Український серіал про життя мешканців та гостей старого львівського готелю. Кожна серія розповідає про цікаві історії, які відбуваються в стінах готелю, переплітаючи долі різних персонажів, їхні драми, комедійні ситуації та романтичні пригоди на тлі атмосфери Львова."
  },
{
  "title": "Вечірка",
  "genre": ["комедія"],
  "time": 25,
  "episode_time": 25,
  "seasons": 2,
  "episodes_per_season": 12,
  "type": "серіал",
  "image": "Вечірка.jpg",
  "description": "Український комедійний серіал про компанію друзів, які влаштовують різноманітні вечірки. Кожна серія — це нова вечірка з непередбачуваними ситуаціями, кумедними непорозуміннями та веселими пригодами, які супроводжують героїв у їхньому повсякденному житті."
  },
{
  "title": "Одного разу під Полтавою",
  "genre": ["комедія"],
  "time": 25,
  "episode_time": 25,
  "seasons": 9,
  "episodes_per_season": 20,
  "type": "серіал",
  "image": "Одного_разу_під_Полтавою.jpg",
  "description": "Український комедійний серіал про життя мешканців невеликого села під Полтавою. Головні герої — родина Sverстюків та їхні сусіди потрапляють у кумедні ситуації, демонструючи гумор, колорит українського села, сімейні цінності та традиції з сучасним поглядом на сільське життя."
  },
{
  "title": "Танька і Володька",
  "genre": ["комедія"],
  "time": 25,
  "episode_time": 25,
  "seasons": 4,
  "episodes_per_season": 20,
  "type": "серіал",
  "image": "Танька_і_Володька.jpg",
  "description": "Український комедійний серіал про молоде подружжя Таню та Володю, які щойно одружилися та переїхали до Києва. Вони стикаються з кумедними ситуаціями сімейного життя, конфліктами між родичами, побутовими проблемами та пригодами адаптації до столичного життя, зберігаючи любов та гумор."
  },
{
    "title": "Слуга народу",
    "genre": ["комедія", "драма"],
    "time": 25,
    "episode_time": 25,
    "seasons": 3,
    "episodes_per_season": 20,
    "type": "серіал",
    "image": "Слуга_народу.jpg",
    "description": "Український комедійний серіал про вчителя історії Василя Голобородька, який випадково стає президентом України після того, як його емоційний монолог про корупцію стає вірусним в інтернеті. Серіал висміює політичну систему та показує боротьбу звичайної людини з державною машиною."
  },
{
    "title": "Школа",
    "genre": ["драма", "молодіжний"],
    "time": 45,
    "episode_time": 45,
    "seasons": 2,
    "episodes_per_season": 40,
    "type": "серіал",
    "image": "Школа.jpg",
    "description": "Український драматичний серіал про життя учнів, вчителів та батьків звичайної київської школи. Серіал порушує актуальні проблеми сучасної молоді: булінг, перше кохання, стосунки з батьками, тиск суспільства та пошук себе."
  },
{
    "title": "Захар Беркут",
    "genre": ["пригоди", "історичний", "екшн"],
    "time": 96,
    "type": "фільм",
    "image": "Захар_Беркут.jpg",
    "description": "Історичний фільм-екшн за мотивами повісті Івана Франка. Карпатське плем'я тухольців під керівництвом старійшини Захара Беркута дає відсіч монгольській орді у XIII столітті. Фільм оспівує патріотизм, єдність народу та любов до рідної землі."
  },
{
  "title": "Євродиректор",
  "genre": ["комедія"],
  "time": 25,
  "episode_time": 25,
  "seasons": 2,
  "episodes_per_season": 16,
  "type": "серіал",
  "image": "Євродиректор.jpg",
  "description": "Український комедійний серіал про чиновника, який намагається впровадити європейські стандарти в українській бюрократичній системі. Герой стикається з абсурдними ситуаціями, корупцією та радянськими пережитками, намагаючись змінити систему зсередини із гумором та оптимізмом."
}
]